app/Http/Controllers/Auth/LoginController.php

select * from `users` where `email` = 'guest@guest.com' limit 1
---
    public function guestLogin()
    {
        $user = User::where('email', self::GUEST_USER_EMAIL)->first();