app/Http/Controllers/ImageListController.php

select * from `upload_images` where `upload_images`.`user_id` = 6 and `upload_images`.`user_id` is not null order by `id` desc
---
    function show(){
        // 認証済みユーザを取得
        $user = \Auth::user();
		//アップロードした画像を取得
		$uploads = $user->uploadimages()->orderBy("id", "desc")->get();